#include <stdio.h>

/**
 * 题目：打印出杨辉三角形（要求打印出10行）。
 * 1
 * 1    1
 * 1    2    1
 * 1    3    3    1
 * 1    4    6    4    1
 * 1    5   10   10    5    1
 * 1    6   15   20   15    6    1
 * 1    7   21   35   35   21    7    1
 * 1    8   28   56   70   56   28    8    1
 * 1    9   36   84  126  126   84   36    9    1
 */

int main(){
    int a[10][10] = {};

    for(int i = 0; i < 10; i++){
        for(int j = 0; j <= i; j++){
            if(j == i || j == 0){
                a[i][j] = 1;
            }else{
                a[i][j] = a[i - 1][j] + a[i - 1][j - 1];
            }
        }
    }
    // 输出结果
    for(int i = 0; i < 10; i++){
        for(int j = 0; j <= i; j++){
            printf("%-4d",a[i][j]);
        }
        printf("\n");
    }
    return 0;
}
